In [65]:
import pandas as pd
import random

In [66]:
df = pd.read_excel('tb.xlsx', sheet_name=None)

In [67]:
df.keys()

dict_keys(['tb_balances', 'tb_desc', 'fs_groupings'])

In [68]:
df_bal = df['tb_balances'].copy()
df_desc = df['tb_desc'].copy()
df_group = df['fs_groupings'].copy()

In [33]:
df_group.head(2)

   Account Financial Statement Grouping
0     1000    Cash and cash equivalents
1     1010    Cash and cash equivalents

In [34]:
df_bal.head(2)

   Account  Balance
0     1000    79256
1     1010    24498

In [35]:
df_desc.head(2)

   Account                            Description
0     1000                             Petty Cash
1     1010  Cash on Hand (e.g. in cash registers)

In [17]:
df_desc_dict = dict(zip(df_desc['Account'], df_desc['Description']))

In [24]:
df_desc_dict[1000]

'Petty Cash'

In [18]:
df_desc_dict[1010]

'Cash on Hand (e.g. in cash registers)'

In [26]:
def lookup_desc(act):
    return df_desc_dict.get(act, 'ERROR: Acct not found')

In [27]:
lookup_desc(1000)

'Petty Cash'

In [28]:
df_bal['Description'] = df_bal['Account'].map(lookup_desc)
df_bal.head(2)

   Account  Balance                            Description
0     1000    79256                             Petty Cash
1     1010    24498  Cash on Hand (e.g. in cash registers)

In [149]:
df_group_dict = dict(zip(df_desc['Account'], df_group['Financial Statement Grouping']))

In [150]:
def lookup_group(act):
    return df_group_dict.get(act, 'ERROR: Grouping not found')

In [151]:
lookup_group(1000)

'Cash and cash equivalents'

In [152]:
df_bal['FS Group'] = df_bal['Account'].map(lookup_group)

In [162]:
df_bal.head(2)

,Account,Balance,Description,FS Group
0,1000,79256,Petty Cash,Cash and cash equivalents
1,1010,24498,Cash on Hand (e.g. in cash registers),Cash and cash equivalents

In [163]:
df_bal.pivot_table(index='FS Group', values='Balance', aggfunc=sum).head(2)

                          Balance
FS Group
Accounts payable            40897
Accounts receivable, net    81124

## Alternative Execution

In [37]:
df_bal.merge(df_desc, how = 'left', on = 'Account')

     Account  Balance                            Description
0       1000    79256                             Petty Cash
1       1010    24498  Cash on Hand (e.g. in cash registers)
2       1020   -54289               Regular Checking Account
3       1030    76519               Payroll Checking Account
4       1040   -12535                        Savings Account
..       ...      ...                                    ...
135     7700   -59027             Salaries Expense, Officers
136     7750   -33353                          Wages Expense
137     7800   -63677                      Utilities Expense
138     8900   -65432                          Other Expense
139     9000    87798            Gain/Loss on Sale of Assets

[140 rows x 3 columns]

In [73]:
df_merge=df_bal.merge(df_group, how = 'left', on = 'Account')
df_merge.head()

   Account  Balance Financial Statement Grouping
0     1000    79256    Cash and cash equivalents
1     1010    24498    Cash and cash equivalents
2     1020   -54289    Cash and cash equivalents
3     1030    76519    Cash and cash equivalents
4     1040   -12535    Cash and cash equivalents

In [71]:
df_merge.rename(columns={"Financial Statement Grouping":"FSG"},inplace=True)

In [72]:
df_merge.head()

   Account  Balance                        FSG
0     1000    79256  Cash and cash equivalents
1     1010    24498  Cash and cash equivalents
2     1020   -54289  Cash and cash equivalents
3     1030    76519  Cash and cash equivalents
4     1040   -12535  Cash and cash equivalents

In [64]:
df_merge[['Balance','FSG']].groupby('FSG').sum()

                              Balance
FSG
Accounts payable                40897
Accounts receivable, net        81124
Accrued expenses                11866
Capital                          2800
Capital surplus                  1049
Cash and cash equivalents      106189
Cost of goods sold             -41942
Deferred revenue               -27622
Deposits                        29768
Discounts                       15014
Interest income                -79133
Inventory                      -89868
Long-term debt, current         68184
Notes payable                   66647
Notes receivable                 -970
Notes receivable, noncurrent    -4324
Operating costs               -210329
Organization costs, net       -128221
Other current assets            16667
Other current liabilities     -158063
Other income                     7154
Other long-term liabilities     97425
Other non-current assets       -26977
Prepaids and advances           51274
Property and equipment, net    260251
Reimbursements                 -85446
Retained earnings              -37271
Returns and allowances         -30767
Sales                          112404